# SQL Statements and Operators

---------

Pattern Matching
-----------

What would be the output of the following query: 'select * from employee where first_name like "%ee%";'?

---------------

Answer:
------------

It will display the details of all the employees whose name contains ‘ee’.

--------------

Feedback:
--------------

The % character can replace any number of preceding and trailing characters.

----------------

Reading the Documentation
------------

Refer to the MySQL documentation online and answer the following question:

Which of the following wildcards are supported in SQL?

-------------------

Both % and _ (underscore)

----------

% is a multi-character wildcard, whereas _ is a single-character wildcard. For example, using "_r%" would return the words with the second character as r, followed by zero or more characters at the end.

-----------------

Operators
----------

With SQL, how do you select all the records from a table named ‘employees’ where the ‘LastName’ is alphabetically between (and includes) ‘Joshi’ and ‘Sharma’?

----------------

select * from employees where LastName between ‘Joshi’ and ‘Sharma’;

-----------------

This query will return employees who have Joshi and Sharma as surnames, along with all the surnames that are in-between alphabetically.

----------------

Operators
--------

Which of the queries given below would return the same output? 

More than one option may be correct.

-----------------

select * from employees where EmpID in (2,3,4, 5);

select * from employees where EmpID between 2 and 5;

select * from employees where EmpID >= 2 and EmpID <= 5;

--------------

Feedback:

This query will return the details of the employees with employee ids 2, 3, 4 and 5.

-------------------

Basic Select
------------

Description

Consider the following table employees containing the following columns:

Employees

![](https://media-doselect.s3.amazonaws.com/generic/OqNgkRAgJpJMpzxNJZMXNdYXR/Employee_Table.PNG)

Write a query to determine the first names of all employees.

----------------------

Query
--------

    use upgrad;

    # Write your code below
    select firstname from Employees;

# Aggregate Functions

----------------